# myutils/config.py
subject_list=['s01','s02','s03','s04','s05','s06','s07','s08','s09','s10','s11','s12','s13','s14']

ch_to_keep = {
        's01': [],
	's02': ['Tp7', 'P3', 'C3', 'F8', 'Cpz', 'P4', 'Fc4', 'Fpz', 'Fp1', 'Fz', 'T4', 'Ft8', 'T3', 'Pz'],
	's03': ['Po7', 'O1', 'Oz', 'P5', 'T5', 'P3', 'Tp7', 'Pz', 'T3', 'Cz', 'C4', 'F7', 'Ft7', 'C3', 'Fc3', 'Fp1', 'Fpz', 'F3'],
	's04': ['F7', 'Ft7', 'Fp1', 'F3', 'Fc3', 'Fpz', 'Fp2', 'Fz', 'Fcz', 'T3', 'C3', 'Cz', 'Tp7', 'T5', 'P5'],
        's05': ['Fp1','Fpz','Fp2','F3','Fz','F4','F8','Fcz','Fc4','Ft8','Cpz'],
        's06': ['Fp1','Fpz','Fp2','F7','F3','Fz','F4','F8','Ft7','Fc3','Fcz','Fc4','Ft8'],
        's07': ['Fp1','Fpz','Fp2','F7','F3','Fz','F4','F8','Ft7'],
        's08': ['Fp1','Fpz','Fp2','F7','F3','Fz','F4','F8','Ft7','Fc3','Fcz','Fc4','Ft8','T3','C3','Cz','C4','T4','Tp7','Cp3','Cpz','Cp4','Tp8','Pz','P4','T6'],
        's09': ['Fp1','Fpz','Fp2','F8','F4'],
        's10': ['FC3','F7','F3','T6','FCz','FC4','Ft8','Fz','F4','F8','Fp2','Fpz','Fp1'],
        's11': ['Fp1','F7','Ft7','T3','F8','Fp2','Fpz','F3','Fc3','Tp7','Fc4'],
        's12': ['F7','F3','Fz','F4','F8','Fp1','Fpz','FC4','Fp2','Ft8','T4'],
        's13': ['Fp1','Fpz','Fp2','F8','Fc4','Ft8','F4','FCz','FC3','T4','Tp8'],
        's14': ['FP1','FPz','FP2','F7','F3','F2','F4','F8','Ft7','Ft8'],
        's15': ['Fp2','Fpz','F4','F8','Fp1','Fz','F3','F7','Ft8','Fc4','Fcz','Fc3','Ft7']
}

best_ch_by_power = {
    's02': ['Fp1','F8','T3'],
    's03': ['Fp1','C4','Tp7','P3','Oz'],
    's04': ['Fp1','F7','Fcz','C3','Cz','P5'],
    's05': ['Fz','F8'], # Слишком мало эпох в 1 сессии
    's06': ['F7','F8'],
    's07': ['Fpz','F8'],
#     's08': [], # Каналов много, толку 0 + только 4 активности
    's09': ['Fp2','F8'],
    's10': ['Fp1','Fpz','Fp2','F3','Fz','F8','T6'],
    's11': ['Fp1','Fpz','Fp2','F7','F3','F8','Tp7'], # отобрал только самое лучшее
    's12': ['Fp1', 'F4'],
    's13': ['T4','Tp8'],
#     's14': [], # 
    's15': ['Fp2','F8','Fcz'] #Ft7 F4 очень шумное, амплитуда в целом слишком высока - до 100 мВ
} # Запись, сделанная с Гургеном s11 намного лучше записей сделанных в одиночку s14 и s15

epoch_thresh_dict = {
        'default': 70e-5,
        's01': 70e-5,
	    's02': 70e-5,
    	's03': 70e-5,
	    's04': 30e-4,
        's05': 70e-5,
        's06': 70e-5,
        's07': 3,
        's08': 3,
        's09': 70e-5,
        's10': 70e-5,
        's11': 70e-5,
        's12': 70e-5,
        's13': 13e-4,
        's14': 13e-4, # очень шумно, нужно применить фильтры перед обработкой
        's15': 70e-5,
}

maxwell_thresh_dict = {
    "default": 1e-14
}

